doc/example/DeviceInformation.xml

<!--URL: http://<ip>:2020/onvif/device_service-->
<!--Sample Request to get device information with authentication-->
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:wsa="http://www.w3.org/2005/08/addressing"
    xmlns:tet="http://www.onvif.org/ver10/device/wsdl">
    <SOAP-ENV:Header>
        <wsa:Action>
            http://www.onvif.org/ver10/device/wsdl/GetDeviceInformation
        </wsa:Action>
        <Security s:mustUnderstand="1"
            xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <UsernameToken>
                <Username>username</Username>
                <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">password</Password>
                <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">nounce</Nonce>
                <Created xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">RFC3389 Timestamp</Created>
            </UsernameToken>
        </Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <tet:GetDeviceInformation>
        </tet:GetDeviceInformation>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
