ONVIF-SIM/auth_example.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
  ONVIF Authentication Example
  
  This file demonstrates the WS-Security UsernameToken format used for
  ONVIF device authentication. The authentication header must be included
  in the SOAP Header of each authenticated request.
-->

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
            xmlns:tds="http://www.onvif.org/ver10/device/wsdl">
  
  <!-- SOAP Header with WS-Security Authentication -->
  <s:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                   xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:UsernameToken>
        <!-- Plain text username -->
        <wsse:Username>admin</wsse:Username>
        
        <!-- Password Digest (not plain text) -->
        <!-- Digest = Base64( SHA1( Nonce + Created + Password ) ) -->
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">
          dGVzdHBhc3N3b3JkZGlnZXN0
        </wsse:Password>
        
        <!-- Random nonce (Base64 encoded) -->
        <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">
          cmFuZG9tbm9uY2U=
        </wsse:Nonce>
        
        <!-- UTC timestamp in ISO 8601 format -->
        <wsu:Created>2026-01-20T04:00:00Z</wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </s:Header>
  
  <!-- SOAP Body with actual request -->
  <s:Body>
    <tds:GetDeviceInformation/>
  </s:Body>
  
</s:Envelope>

<!--
  AUTHENTICATION SECURITY NOTES:
  
  1. Password is NEVER sent in plain text
  2. Password Digest uses SHA-1 hash of: Nonce + Created + Password
  3. Nonce prevents replay attacks (should be unique per request)
  4. Created timestamp prevents old requests from being replayed
  5. Both nonce and digest are Base64 encoded
  
  USAGE IN C CODE:
  
  #include "auth.h"
  
  char buffer[4096];
  const char *body = "<tds:GetDeviceInformation/>";
  
  if (build_authenticated_request("admin", "password", body, buffer, sizeof(buffer)) == 0) {
      // Send buffer via HTTP POST to device
  }
-->
